nxp-mcuxpresso/mcux-soc-svd/KW43B43ZC6/KW43B43ZC6.xml
        <register>
          <name>RAM_IF_CFG</name>
          <description>PACKET RAM INTERFACE CONFIG</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RAM_IF_TX_EN</name>
              <description>RAM interface TX enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RAM_IF_TX_EN_0</name>
                  <description>Disable RAM interface TX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM_IF_TX_EN_1</name>
                  <description>Enable RAM interface TX</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM_IF_RX_EN</name>
              <description>RAM interface RX enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RAM_IF_RX_EN_0</name>
                  <description>Disable RAM interface RX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM_IF_RX_EN_1</name>
                  <description>Enable RAM interface RX</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM_IF_IE</name>
              <description>RAM interface interrupt enable bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RAM_IF_IE_0</name>
                  <description>Disable RAM interface interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM_IF_IE_1</name>
                  <description>Enable RAM interface interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM_IF_IC</name>
              <description>RAM interface interrupt clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RAM_IF_IC_0</name>
                  <description>To do nothing to RAM interface interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM_IF_IC_1</name>
                  <description>To clear RAM interface interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>H2S_EN</name>
              <description>Hard bit convert to soft bit enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>H2S_EN_0</name>
                  <description>Disable hard bit to soft bits conversion</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>H2S_EN_1</name>
                  <description>Enable hard bit to soft bits conversion</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOFT_HD_SEL_RD</name>
              <description>Soft and hard bit selection of write operation</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SOFT_HD_SEL_RD_0</name>
                  <description>Hard bit selection of write operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOFT_HD_SEL_RD_1</name>
                  <description>Soft bit selection of write operation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOFT_HD_SEL_WR</name>
              <description>Soft and hard bit selection of read operation</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SOFT_HD_SEL_WR_0</name>
                  <description>Hard bit selection of read operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOFT_HD_SEL_WR_1</name>
                  <description>Soft bit selection of read operation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WR_IRQ</name>
              <description>Write to RAM complete flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WR_IRQ_0</name>
                  <description>Writing to RAM not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WR_IRQ_1</name>
                  <description>Writing to RAM complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RD_IRQ</name>
              <description>Read to RAM complete flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RD_IRQ_0</name>
                  <description>Reading to RAM not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RD_IRQ_1</name>
                  <description>Reading to RAM complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
