nxp-mcuxpresso/mcux-soc-svd/KW43B43ZC6/KW43B43ZC6.xml
        <register>
          <name>OVRD1</name>
          <description>TSM OVERRIDE REGISTER 1</description>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_LDOTRIM_PUP_OVRD_EN</name>
              <description>Override control for SEQ_LDOTRIM_PUP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_LDOTRIM_PUP_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_LDOTRIM_PUP_OVRD_EN_1</name>
                  <description>Use the state of SEQ_LDOTRIM_PUP_OVRD to override the signal &quot;seq_ldotrim_pup&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_LDOTRIM_PUP_OVRD</name>
              <description>Override value for SEQ_LDOTRIM_PUP</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LDO_CAL_PUP_OVRD_EN</name>
              <description>Override control for SEQ_LDO_CAL_PUP</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_LDO_CAL_PUP_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_LDO_CAL_PUP_OVRD_EN_1</name>
                  <description>Use the state of SEQ_LDO_CAL_PUP_OVRD to override the signal &quot;seq_ldo_cal_pup&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_LDO_CAL_PUP_OVRD</name>
              <description>Override value for SEQ_LDO_CAL_PUP</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_BG_FC_OVRD_EN</name>
              <description>Override control for SEQ_BG_FC</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_BG_FC_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_BG_FC_OVRD_EN_1</name>
                  <description>Use the state of SEQ_BG_FC_OVRD to override the signal &quot;seq_bg_fc&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_BG_FC_OVRD</name>
              <description>Override value for SEQ_BG_FC</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LDO_PLL_FC_OVRD_EN</name>
              <description>Override control for SEQ_LDO_PLL_FC</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_LDO_PLL_FC_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_LDO_PLL_FC_OVRD_EN_1</name>
                  <description>Use the state of SEQ_LDO_PLL_FC_OVRD to override the signal &quot;seq_ldo_pll_fc&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_LDO_PLL_FC_OVRD</name>
              <description>Override value for SEQ_LDO_PLL_FC</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LDO_VCO_FC_OVRD_EN</name>
              <description>Override control for SEQ_LDO_VCO_FC</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_LDO_VCO_FC_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_LDO_VCO_FC_OVRD_EN_1</name>
                  <description>Use the state of SEQ_LDO_VCO_FC_OVRD to override the signal &quot;seq_ldo_vco_fc&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_LDO_VCO_FC_OVRD</name>
              <description>Override value for SEQ_LDO_VCO_FC</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LDO_RXTXHF_FC_OVRD_EN</name>
              <description>Override control for SEQ_LDO_RXTXHF_FC</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_LDO_RXTXHF_FC_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_LDO_RXTXHF_FC_OVRD_EN_1</name>
                  <description>Use the state of SEQ_LDO_RXTXHF_FC_OVRD to override the signal &quot;seq_ldo_rxtxhf_fc&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_LDO_RXTXHF_FC_OVRD</name>
              <description>Override value for SEQ_LDO_RXTXHF_FC</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LDO_RXTXLF_FC_OVRD_EN</name>
              <description>Override control for SEQ_LDO_RXTXLF_FC</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_LDO_RXTXLF_FC_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_LDO_RXTXLF_FC_OVRD_EN_1</name>
                  <description>Use the state of SEQ_LDO_RXTXLF_FC_OVRD to override the signal &quot;seq_ldo_rxtxlf_fc&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_LDO_RXTXLF_FC_OVRD</name>
              <description>Override value for SEQ_LDO_RXTXLF_FC</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LDO_ANT_PUP_OVRD_EN</name>
              <description>Override control for SEQ_LDO_ANT_PUP</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_LDO_ANT_PUP_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_LDO_ANT_PUP_OVRD_EN_1</name>
                  <description>Use the state of SEQ_LDO_ANT_PUP_OVRD to override the signal &quot;seq_ldo_ant_pup&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_LDO_ANT_PUP_OVRD</name>
              <description>Override value for SEQ_LDO_ANT_PUP</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LDO_PLL_PUP_OVRD_EN</name>
              <description>Override control for SEQ_LDO_PLL_PUP</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_LDO_PLL_PUP_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_LDO_PLL_PUP_OVRD_EN_1</name>
                  <description>Use the state of SEQ_LDO_PLL_PUP_OVRD to override the signal &quot;seq_ldo_pll_pup&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_LDO_PLL_PUP_OVRD</name>
              <description>Override value for SEQ_LDO_PLL_PUP</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LDO_VCO_PUP_OVRD_EN</name>
              <description>Override control for SEQ_LDO_VCO_PUP</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_LDO_VCO_PUP_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_LDO_VCO_PUP_OVRD_EN_1</name>
                  <description>Use the state of SEQ_LDO_VCO_PUP_OVRD to override the signal &quot;seq_ldo_vco_pup&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_LDO_VCO_PUP_OVRD</name>
              <description>Override value for SEQ_LDO_VCO_PUP</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LDO_XO_DIST_PUP_OVRD_EN</name>
              <description>Override control for SEQ_LDO_XO_DIST_PUP</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_LDO_XO_DIST_PUP_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_LDO_XO_DIST_PUP_OVRD_EN_1</name>
                  <description>Use the state of SEQ_LDO_XO_DIST_PUP_OVRD to override the signal &quot;seq_ldo_xo_dist_pup&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_LDO_XO_DIST_PUP_OVRD</name>
              <description>Override value for SEQ_LDO_XO_DIST_PUP</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LDO_RXTXHF_PUP_OVRD_EN</name>
              <description>Override control for SEQ_LDO_RXTXHF_PUP</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_LDO_RXTXHF_PUP_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_LDO_RXTXHF_PUP_OVRD_EN_1</name>
                  <description>Use the state of SEQ_LDO_RXTXHF_PUP_OVRD to override the signal &quot;seq_ldo_rxtxhf_pup&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_LDO_RXTXHF_PUP_OVRD</name>
              <description>Override value for SEQ_LDO_RXTXHF_PUP</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LDO_RXTXLF_PUP_OVRD_EN</name>
              <description>Override control for SEQ_LDO_RXTXLF_PUP</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_LDO_RXTXLF_PUP_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_LDO_RXTXLF_PUP_OVRD_EN_1</name>
                  <description>Use the state of SEQ_LDO_RXTXLF_PUP_OVRD to override the signal &quot;seq_ldo_rxtxlf_pup&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_LDO_RXTXLF_PUP_OVRD</name>
              <description>Override value for SEQ_LDO_RXTXLF_PUP</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LDO_LV_PUP_OVRD_EN</name>
              <description>Override control for SEQ_LDO_LV_PUP</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_LDO_LV_PUP_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_LDO_LV_PUP_OVRD_EN_1</name>
                  <description>Use the state of SEQ_LDO_LV_PUP_OVRD to override the signal &quot;seq_ldo_lv_pup&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_LDO_LV_PUP_OVRD</name>
              <description>Override value for SEQ_LDO_LV_PUP</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_BG_PUP_OVRD_EN</name>
              <description>Override control for SEQ_BG_PUP</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_BG_PUP_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_BG_PUP_OVRD_EN_1</name>
                  <description>Use the state of SEQ_BG_PUP_OVRD to override the signal &quot;seq_bg_pup&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_BG_PUP_OVRD</name>
              <description>Override value for SEQ_BG_PUP</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_BG_PUP_IBG_ANT_OVRD_EN</name>
              <description>Override control for SEQ_BG_PUP_IBG_ANT</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_BG_PUP_IBG_ANT_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_BG_PUP_IBG_ANT_OVRD_EN_1</name>
                  <description>Use the state of SEQ_BG_PUP_IBG_ANT_OVRD to override the signal &quot;seq_bg_pup_ibg_ant&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_BG_PUP_IBG_ANT_OVRD</name>
              <description>Override value for SEQ_BG_PUP_IBG_ANT</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
