nxp-mcuxpresso/mcux-soc-svd/KW43B43ZC6/KW43B43ZC6.xml
        <register>
          <name>OVRD2</name>
          <description>TSM OVERRIDE REGISTER 2</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_BG_PUP_IBG_XO_DIST_OVRD_EN</name>
              <description>Override control for SEQ_BG_PUP_IBG_XO_DIST</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_BG_PUP_IBG_XO_DIST_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_BG_PUP_IBG_XO_DIST_OVRD_EN_1</name>
                  <description>Use the state of SEQ_BG_PUP_IBG_XO_DIST_OVRD to override the signal &quot;seq_bg_pup_ibg_xo_dist&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_BG_PUP_IBG_XO_DIST_OVRD</name>
              <description>Override value for SEQ_BG_PUP_IBG_XO_DIST</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_BG_PUP_IBG_TX_OVRD_EN</name>
              <description>Override control for SEQ_BG_PUP_IBG_TX</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_BG_PUP_IBG_TX_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_BG_PUP_IBG_TX_OVRD_EN_1</name>
                  <description>Use the state of SEQ_BG_PUP_IBG_TX_OVRD to override the signal &quot;seq_bg_pup_ibg_tx&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_BG_PUP_IBG_TX_OVRD</name>
              <description>Override value for SEQ_BG_PUP_IBG_TX</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_BG_PUP_IBG_RX_OVRD_EN</name>
              <description>Override control for SEQ_BG_PUP_IBG_RX</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_BG_PUP_IBG_RX_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_BG_PUP_IBG_RX_OVRD_EN_1</name>
                  <description>Use the state of SEQ_BG_PUP_IBG_RX_OVRD to override the signal &quot;seq_bg_pup_ibg_rx&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_BG_PUP_IBG_RX_OVRD</name>
              <description>Override value for SEQ_BG_PUP_IBG_RX</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_TSM_ISO_B_2P4GHZ_OVRD_EN</name>
              <description>Override control for SEQ_TSM_ISO_B_2P4GHZ</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_TSM_ISO_B_2P4GHZ_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_TSM_ISO_B_2P4GHZ_OVRD_EN_1</name>
                  <description>Use the state of SEQ_TSM_ISO_B_2P4GHZ_OVRD to override the signal &quot;seq_tsm_iso_b_2p4ghz&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_TSM_ISO_B_2P4GHZ_OVRD</name>
              <description>Override value for SEQ_TSM_ISO_B_2P4GHZ</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_RCCAL_PUP_OVRD_EN</name>
              <description>Override control for SEQ_RCCAL_PUP</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_RCCAL_PUP_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_RCCAL_PUP_OVRD_EN_1</name>
                  <description>Use the state of SEQ_RCCAL_PUP_OVRD to override the signal &quot;rx_rccal_pup&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_RCCAL_PUP_OVRD</name>
              <description>Override value for SEQ_RCCAL_PUP</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PD_EN_FCAL_BIAS_OVRD_EN</name>
              <description>Override control for SEQ_PD_EN_FCAL_BIAS</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_PD_EN_FCAL_BIAS_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_PD_EN_FCAL_BIAS_OVRD_EN_1</name>
                  <description>Use the state of SEQ_PD_EN_FCAL_BIAS_OVRD to override the signal &quot;seq_pd_en_fcal_bias&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_PD_EN_FCAL_BIAS_OVRD</name>
              <description>Override value for SEQ_PD_EN_FCAL_BIAS</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PD_PUP_OVRD_EN</name>
              <description>Override control for SEQ_PD_PUP</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_PD_PUP_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_PD_PUP_OVRD_EN_1</name>
                  <description>Use the state of SEQ_PD_PUP_OVRD to override the signal &quot;seq_pd_pup&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_PD_PUP_OVRD</name>
              <description>Override value for SEQ_PD_PUP</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_VCO_PUP_OVRD_EN</name>
              <description>Override control for SEQ_VCO_PUP</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_VCO_PUP_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_VCO_PUP_OVRD_EN_1</name>
                  <description>Use the state of SEQ_VCO_PUP_OVRD to override the signal &quot;seq_vco_pup&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_VCO_PUP_OVRD</name>
              <description>Override value for SEQ_VCO_PUP</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_XO_DIST_EN_OVRD_EN</name>
              <description>Override control for SEQ_XO_DIST_EN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_XO_DIST_EN_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_XO_DIST_EN_OVRD_EN_1</name>
                  <description>Use the state of SEQ_XO_DIST_EN_OVRD to override the signal &quot;seq_xo_dist_en&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_XO_DIST_EN_OVRD</name>
              <description>Override value for SEQ_XO_DIST_EN</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_XO_DIST_EN_CLK_REF_OVRD_EN</name>
              <description>Override control for SEQ_XO_DIST_EN_CLK_REF</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_XO_DIST_EN_CLK_REF_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_XO_DIST_EN_CLK_REF_OVRD_EN_1</name>
                  <description>Use the state of SEQ_XO_DIST_EN_CLK_REF_OVRD to override the signal &quot;seq_xo_dist_en_clk_ref&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_XO_DIST_EN_CLK_REF_OVRD</name>
              <description>Override value for SEQ_XO_DIST_EN_CLK_REF</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_XO_EN_CLK_2P4G_OVRD_EN</name>
              <description>Override control for SEQ_XO_EN_CLK_2P4G</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_XO_EN_CLK_2P4G_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_XO_EN_CLK_2P4G_OVRD_EN_1</name>
                  <description>Use the state of SEQ_XO_EN_CLK_2P4G_OVRD to override the signal &quot;seq_xo_en_clk_2p4g&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_XO_EN_CLK_2P4G_OVRD</name>
              <description>Override value for SEQ_XO_EN_CLK_2P4G</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_XO_DIST_EN_CLK_ADCDAC_OVRD_EN</name>
              <description>Override control for SEQ_XO_DIST_EN_CLK_ADCDAC</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_XO_DIST_EN_CLK_ADCDAC_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_XO_DIST_EN_CLK_ADCDAC_OVRD_EN_1</name>
                  <description>Use the state of SEQ_XO_DIST_EN_CLK_ADCDAC_OVRD_EN to override the signal &quot;seq_xo_dist_en_clk_adcdac&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_XO_DIST_EN_CLK_ADCDAC_OVRD</name>
              <description>Override value for SEQ_XO_DIST_EN_CLK_ADCDAC</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_DAC_PUP_OVRD_EN</name>
              <description>Override control for SEQ_DAC_PUP</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_DAC_PUP_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_DAC_PUP_OVRD_EN_1</name>
                  <description>Use the state of SEQ_DAC_PUP_OVRD to override the signal &quot;seq_dac_pup&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_DAC_PUP_OVRD</name>
              <description>Override value for SEQ_DAC_PUP</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_VCO_EN_HPM_OVRD_EN</name>
              <description>Override control for SEQ_VCO_EN_HPM</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_VCO_EN_HPM_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_VCO_EN_HPM_OVRD_EN_1</name>
                  <description>Use the state of SEQ_VCO_EN_HPM_OVRD to override the signal &quot;seq_vco_en_hpm&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_VCO_EN_HPM_OVRD</name>
              <description>Override value for SEQ_VCO_EN_HPM</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LO_PUP_VLO_FBK_OVRD_EN</name>
              <description>Override control for SEQ_LO_PUP_VLO_FBK</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_LO_PUP_VLO_FBK_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_LO_PUP_VLO_FBK_OVRD_EN_1</name>
                  <description>Use the state of SEQ_LO_PUP_VLO_FBK_OVRD to override the signal &quot;seq_lo_pup_vlo_fbk&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_LO_PUP_VLO_FBK_OVRD</name>
              <description>Override value for SEQ_LO_PUP_VLO_FBK</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LO_PUP_VLO_RXDRV_OVRD_EN</name>
              <description>Override control for SEQ_LO_PUP_VLO_RXDRV</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_LO_PUP_VLO_RXDRV_OVRD_EN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_LO_PUP_VLO_RXDRV_OVRD_EN_1</name>
                  <description>Use the state of SEQ_LO_PUP_VLO_RXDRV_OVRD to override the signal &quot;seq_lo_pup_vlo_rxdrv&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_LO_PUP_VLO_RXDRV_OVRD</name>
              <description>Override value for SEQ_LO_PUP_VLO_RXDRV</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
