nxp-mcuxpresso/mcux-soc-svd/KW43B43ZC6/KW43B43ZC6.xml
        <register>
          <name>ble_reg_int_sts_0</name>
          <description>BLE Interrupt Status 0</description>
          <addressOffset>0x740</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rt_err_intr</name>
              <description>rt_err_intr interrupt, At least 1 of the real-time error events has been asserted. Read BLE_REG_RT_ERR_STS for details.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>cdt_expiry_intr_5</name>
              <description>cdt_expiry_intr[5] interrupt, CDT 5 trigger countdown timer.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>cdt_expiry_intr_4</name>
              <description>cdt_expiry_intr[4] interrupt, CDT 4 trigger countdown timer.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>cdt_expiry_intr_3</name>
              <description>cdt_expiry_intr[3] interrupt, CDT 3 trigger countdown timer.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>cdt_expiry_intr_2</name>
              <description>cdt_expiry_intr[2] interrupt, CDT 2 trigger countdown timer.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>cdt_expiry_intr_1</name>
              <description>cdt_expiry_intr[1] interrupt, CDT 1 trigger countdown timer.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>cdt_expiry_intr_0</name>
              <description>cdt_expiry_intr[0] interrupt, CDT 0 trigger countdown timer.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>expiry_intr_3</name>
              <description>expiry_intr[3] interrupt, SWT 3 expiration interrupt.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>expiry_intr_2</name>
              <description>expiry_intr[2] interrupt, SWT 2 expiration interrupt.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>expiry_intr_1</name>
              <description>expiry_intr[1] interrupt, SWT 1 expiration interrupt.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>expiry_intr_0</name>
              <description>expiry_intr[0] interrupt, SWT 0 expiration interrupt.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>tmr_abort_intr</name>
              <description>tmr_abort_intr interrupt, SWT timer abort interrupt.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>hw_abort_intr</name>
              <description>hw_abort_intr interrupt, At least 1 of the hardware abort events has been asserted. Read BLE_REG_HW_ABORT_STS for details.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>sw_abort_intr</name>
              <description>sw_abort_intr interrupt, Software DBUS access has been aborted.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>rx_pkt_done_intr</name>
              <description>rx_pkt_done_intr interrupt, Receive packet done.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>rx_data_done_intr</name>
              <description>rx_data_done_intr interrupt, Receive data (payload &amp; MIC) done.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>rx_adv_ext_header_done_intr</name>
              <description>rx_adv_ext_header_done_intr interrupt, Packet has completed advertising extension header portion.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>irk_resolve_done_intr</name>
              <description>irk_resolve_done_intr interrupt, SWT timer abort interrupt.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>rx_adv_addr_done_intr</name>
              <description>rx_adv_addr_done_intr interrupt, Packet has completed first 48-bits device address portion (for adv channel only). Interrupt is also generated if reuse_rx_adv_addr_done_intr =1 and if advA bit is 0 in the extended header flag of the advertisement packet received. Interrupt is generated after reception of the extended header flag field.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>rx_hdr_done_intr</name>
              <description>rx_hdr_done_intr interrupt, Receive header done.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>cor_hit_intr</name>
              <description>cor_hit_intr interrupt, Correlation has been detected.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>tx_pkt_done_intr</name>
              <description>tx_pkt_done_intr interrupt, Transmit packet done.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>tx_data_done_intr</name>
              <description>tx_data_done_intr interrupt, Transmit data (payload &amp; MIC) done.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>tx_hdr_done_intr</name>
              <description>tx_hdr_done_intr interrupt, Transmit header done.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>tx_acc_done_intr</name>
              <description>tx_acc_done_intr interrupt, Packet has completed access code portion.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_int_sts_1</name>
          <description>BLE Interrupt Status 1</description>
          <addressOffset>0x744</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rt_err_intr</name>
              <description>rt_err_intr interrupt, At least 1 of the real-time error events has been asserted. Read BLE_REG_RT_ERR_STS for details.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>cdt_expiry_intr_5</name>
              <description>cdt_expiry_intr[5] interrupt, CDT 5 trigger countdown timer.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>cdt_expiry_intr_4</name>
              <description>cdt_expiry_intr[4] interrupt, CDT 4 trigger countdown timer.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>cdt_expiry_intr_3</name>
              <description>cdt_expiry_intr[3] interrupt, CDT 3 trigger countdown timer.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>cdt_expiry_intr_2</name>
              <description>cdt_expiry_intr[2] interrupt, CDT 2 trigger countdown timer.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>cdt_expiry_intr_1</name>
              <description>cdt_expiry_intr[1] interrupt, CDT 1 trigger countdown timer.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>cdt_expiry_intr_0</name>
              <description>cdt_expiry_intr[0] interrupt, CDT 0 trigger countdown timer.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>expiry_intr_3</name>
              <description>expiry_intr[3] interrupt, SWT 3 expiration interrupt.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>expiry_intr_2</name>
              <description>expiry_intr[2] interrupt, SWT 2 expiration interrupt.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>expiry_intr_1</name>
              <description>expiry_intr[1] interrupt, SWT 1 expiration interrupt.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>expiry_intr_0</name>
              <description>expiry_intr[0] interrupt, SWT 0 expiration interrupt.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>tmr_abort_intr</name>
              <description>tmr_abort_intr interrupt, SWT timer abort interrupt.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>hw_abort_intr</name>
              <description>hw_abort_intr interrupt, At least 1 of the hardware abort events has been asserted. Read BLE_REG_HW_ABORT_STS for details.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>sw_abort_intr</name>
              <description>sw_abort_intr interrupt, Software DBUS access has been aborted.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>rx_pkt_done_intr</name>
              <description>rx_pkt_done_intr interrupt, Receive packet done.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>rx_data_done_intr</name>
              <description>rx_data_done_intr interrupt, Receive data (payload &amp; MIC) done.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>rx_adv_ext_header_done_intr</name>
              <description>rx_adv_ext_header_done_intr interrupt, Packet has completed advertising extension header portion.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>irk_resolve_done_intr</name>
              <description>irk_resolve_done_intr interrupt, SWT timer abort interrupt.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>rx_adv_addr_done_intr</name>
              <description>rx_adv_addr_done_intr interrupt, Packet has completed first 48-bits device address portion (for adv channel only). Interrupt is also generated if reuse_rx_adv_addr_done_intr =1 and if advA bit is 0 in the extended header flag of the advertisement packet received. Interrupt is generated after reception of the extended header flag field.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>rx_hdr_done_intr</name>
              <description>rx_hdr_done_intr interrupt, Receive header done.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>cor_hit_intr</name>
              <description>cor_hit_intr interrupt, Correlation has been detected.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>tx_pkt_done_intr</name>
              <description>tx_pkt_done_intr interrupt, Transmit packet done.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>tx_data_done_intr</name>
              <description>tx_data_done_intr interrupt, Transmit data (payload &amp; MIC) done.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>tx_hdr_done_intr</name>
              <description>tx_hdr_done_intr interrupt, Transmit header done.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>tx_acc_done_intr</name>
              <description>tx_acc_done_intr interrupt, Packet has completed access code portion.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_int_sts_2</name>
          <description>BLE Interrupt Status 2</description>
          <addressOffset>0x748</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>sw_aes_done</name>
              <description>sw_aes_done interrupt, Software AES has been finished.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>sw_dbus_done_intr</name>
              <description>sw_dbus_done_intr interrupt, Software DBUS access has been finished.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>sw_mailbox_intr</name>
              <description>sw_mailbox_intr interrupt, BLE_REG_INT_SW_MBOX register has been written.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>mws_frame_sync_real_int</name>
              <description>MWS Frame Sync Interrupt</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>mws_pattern_real_int</name>
              <description>MWS Pattern Interrupt</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>frame_sync_update_real_int</name>
              <description>MWS Frame Sync Update Interrupt, Indicating MWS_Frame_Sync has drastic timing change from previous one that Bluetooth firmware should consider piconet clock adjustment to re-align with MWS frame.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>harq_pattern_sel_real_int</name>
              <description>HARQ Pattern Sel Interrupt</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>mws_scan_frequency_real_int</name>
              <description>MWS Scan Frequency Interrupt, Asserted when a new non-zero MWS_Scan_Frequency[4:0] value is received from BCA.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>mws_inact_msg_real_int</name>
              <description>MWS_Inactivity_Message Interrupt, Asserted when a new MWS_Inact_Msg[4:0] value is received from BCA.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
