nxp-mcuxpresso/mcux-soc-svd/KW43B43ZC6/KW43B43ZC6.xml
        <register>
          <name>ble_reg_tmr_cdt_ctl_3</name>
          <description>Qus Count Down Timer 3: Control</description>
          <addressOffset>0x868</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>expiry_emask_intr</name>
              <description>Event Mask: Interrupt, Expiration Event Mask for Interrupt, 0x0: no event, 0x1: interrupt triggered at expiry of timer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_emask_tx</name>
              <description>Event Mask: Tx, Expiration Event Mask for triggering an Tx transaction., 0x0: no event, 0x1: Tx event triggered at timer expiry</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_emask_rx</name>
              <description>Event Mask: Rx, Expiration Event Mask for triggering an Rx transaction., 0x0: no event, 0x1: Rx event triggered at timer expiry</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_emask_abort</name>
              <description>Event Mask: Abort, Expiration Event Mask for triggering an Abort from software., 0x0: no event, 0x1: Abort triggered at timer expiry</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>start_emask_ble_txstart</name>
              <description>Event Mask: BLE Tx start, Start Event Mask for triggering the CDT counter. Start counting at the beginning of a BLE Tx transaction., 0x0: no event, 0x1: timer starts counting down from programmed value at start of next BLE Tx, transaction</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>start_emask_ble_rxstart</name>
              <description>Event Mask: BLE Rx start, Start Event Mask for triggering the CDT counter. Start counting at the beginning of a BLE Rx transaction., 0x0: no event, 0x1: timer starts counting down from programmed value at start of next BLE Rx, transaction</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>start_emask_ble_txend</name>
              <description>Event Mask: BLE Tx end, Start Event Mask for triggering the CDT counter. Start counting at the end of a BLE Tx transaction., 0x0: no event, 0x1: timer starts counting down from programmed value at end of next BLE Tx, transaction</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>start_emask_ble_rxend</name>
              <description>Event Mask: BLE Rx end, Start Event Mask for triggering the CDT counter. Start counting at the end of a BLE Rx transaction., 0x0: no event, 0x1: timer starts counting down from programmed value at end of next BLE Rx, transaction</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>start_emask_btc_pktend</name>
              <description>Event Mask: BTC PKT end, Start Event Mask for triggering the CDT counter. Start counting at the end of a BTC Tx or Rx transaction., 0x0: no event, 0x1: timer starts counting down from programmed value at end of next BTC packet (Tx, or Rx) transaction</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>start_emask_ble_corrhit</name>
              <description>Event Mask: BLE CORR hit, Start Event Mask for triggering the CDT counter. Start counting at BLE correlation hit., 0x0: no event, 0x1: timer starts counting down from programmed value at next BLE correlation hit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>start_emask_bca_req_assert</name>
              <description>Event Mask: BCA request assertion, Start Event Mask for triggering the CDT counter. Start counting at BCA request assertion., 0x0: no event, 0x1: timer starts counting down from programmed value at next BCA_req assertion</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>start_emask_bca_req_deassert</name>
              <description>Event Mask: BCA request deassertion, Start Event Mask for triggering the CDT counter. Start counting at BCA_req de-assertion., 0x0: no event, 0x1: timer starts counting down from programmed value at next BCA_req de-assertion</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>start_emask_ble_corrmiss</name>
              <description>Event Mask: BLE CORR miss, Start Event Mask for triggering the CDT counter. Start counting at BLE correlation timeout interrupt., 0x0: no event, 0x1: timer starts counting down from programmed value at next BLE correlation miss</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>start_emask_sw_trigger</name>
              <description>Event Mask: Software trigger, Start Event Mask for triggering the CDT counter. Start counting when the firmware sets this bit. This bit is self clearing., 0x0: no event, 0x1: timer starts counting down from the programmed value as soon as this bit is set</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
            </field>
            <field>
              <name>start_emask_hw_abort</name>
              <description>Event Mask: Hardware abort, Start Event Mask for triggering the CDT counter. Start counting when hardware abort occurs. The abort may be for a transmit packet or a receive packet., 0x0: no event, 0x1: timer starts counting down from the programmed value bit when hardware abort, happens</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cdt_value_reset</name>
              <description>CDT value reset, This bit resets the CDT counter to 0. It will not trigger any expiry conditions (if programmed). This bit is self clearing, 0x0: no event, 0x1: Timer is reset to 0 immediately</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
            </field>
            <field>
              <name>start_emask_ble_cdt0_expiry</name>
              <description>Event Mask: Chain with CDT0, Start Event Mask for triggering the CDT counter. Start counting when CDT0 expires. This will chain the current CDT with CDT0., 0x0: no event, 0x1: timer starts counting down when CDT0 expires</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>start_emask_ble_cdt1_expiry</name>
              <description>Event Mask: Chain with CDT1, Start Event Mask for triggering the CDT counter. Start counting when CDT1 expires. This will chain the current CDT with CDT1., 0x0: no event, 0x1: timer starts counting down when CDT1 expires</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>start_emask_ble_cdt2_expiry</name>
              <description>Event Mask: Chain with CDT2, Start Event Mask for triggering the CDT counter. Start counting when CDT2 expires. This will chain the current CDT with CDT2., 0x0: no event, 0x1: timer starts counting down when CDT2 expires</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>start_emask_ble_cdt3_expiry</name>
              <description>Event Mask: Chain with CDT3, Start Event Mask for triggering the CDT counter. Start counting when CDT3 expires. This will chain the current CDT with CDT3., 0x0: No event, 0x1: timer starts counting down when CDT3 expires</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>start_emask_ble_cdt4_expiry</name>
              <description>Event Mask: Chain with CDT4, Start Event Mask for triggering the CDT counter. Start counting when CDT4 expires. This will chain the current CDT with CDT4., 0x0: no event, 0x1: timer starts counting down when CDT4 expires</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>start_emask_ble_cdt5_expiry</name>
              <description>Event Mask: Chain with CDT5, Start Event Mask for triggering the CDT counter. Start counting when CDT5 expires. This will chain the current CDT with CDT5., 0x0: no event, 0x1: timer starts counting down when CDT5 expires</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>start_emask_ble_swt0_expiry</name>
              <description>Event Mask: Chain with SWT0, Start Event Mask for triggering the CDT counter. Start counting when SWT0 expires. This will chain the current CDT with SWT0., 0x0: no event, 0x1: timer starts counting down when SWT0 expires</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>start_emask_ble_swt1_expiry</name>
              <description>Event Mask: Chain with SWT1, Start Event Mask for triggering the CDT counter. Start counting when SWT1 expires. This will chain the current CDT with SWT1., 0x0: no event, 0x1: timer starts counting down when SWT1 expires</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>start_emask_ble_swt2_expiry</name>
              <description>Event Mask: Chain with SWT2, Start Event Mask for triggering the CDT counter. Start counting when SWT2 expires. This will chain the current CDT with SWT2., 0x0: no event, 0x1: timer starts counting down when SWT2 expires</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>start_emask_ble_swt3_expiry</name>
              <description>Event Mask: Chain with SWT3, Start Event Mask for triggering the CDT counter. Start counting when SWT3 expires. This will chain the current CDT with SWT3., 0x0: no event, 0x1: timer starts counting down when SWT3 expires</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cdt_matching_mode</name>
              <description>CDT Matching Mode enable, indicates CDT value is not a countdown value; but an absolute value to be matched with the timestamp_qus_cnt_4m counter. Added for KFOURWONE-2451, 0x0: CDT is configured in original Countdown Mode, 0x1: CDT is configured in Matching Mode</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_emask_cs</name>
              <description>Event Mask: CS event for KW PHY, Expiration Event Mask for triggering a CS transaction to KW PHY., 0x0: no event, 0x1: CS event triggered at timer expiry</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cdt_adj_en</name>
              <description>CDT timing adjustment enable, CDT timing adjustment enable for BLE 2M and BLE LR Tx/Rx for CI = 2;8., 0x0: disable, 0x1: enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_tmr_cdt_value_3</name>
          <description>Count Down Timer 3: Count Value</description>
          <addressOffset>0x86C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>countdown_value</name>
              <description>Count Down Value, Number of quarter microseconds to count down from. Range is 1 to 8152 qus.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
