nxp-mcuxpresso/mcux-soc-svd/KW43B43ZC6/KW43B43ZC6.xml
        <register>
          <name>BTU_RIF_BLE_COR_LENGTH_SEL</name>
          <description>BLE Correlation Length Selection</description>
          <addressOffset>0xCA2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_cor_length_sel</name>
              <description>BLE Correlator Length Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>32 bits</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>24 bits</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V2</name>
                  <description>16 bits</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V3</name>
                  <description>not valid</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ble_cor_indicator</name>
              <description>BLE Correlator Indicator</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>no correlator enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>correlator one enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V2</name>
                  <description>correlator two enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V3</name>
                  <description>both correlators enabled</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BLE_COR_ACCESSADDR_0</name>
          <description>BLE AccessCode</description>
          <addressOffset>0xCA4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_access_code_0_16</name>
              <description>BLE Access Code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BLE_COR_ACCESSADDR_1</name>
          <description>BLE AccessCode</description>
          <addressOffset>0xCA6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_access_code_17_32</name>
              <description>BLE Access Code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BLE_COR_WINDOW_0</name>
          <description>BLE Correlation Window Size</description>
          <addressOffset>0xCA8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_cor_window_0</name>
              <description>BLE Correlation Window Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BLE_COR_WINDOW_1</name>
          <description>BLE Correlation Window Size</description>
          <addressOffset>0xCAA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_cor_window_1</name>
              <description>BLE Correlation Window Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BLE_CLK_EN_DELAY</name>
          <description>Tx/Rx Clock Enable Signal Delay</description>
          <addressOffset>0xCAC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1A6A</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>tx_clk_en_delay_qus</name>
              <description>Tx_clk_en Delay Offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_clk_en_delay_qus</name>
              <description>Rx_clk_en Delay Offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BLE_GO_DELAY</name>
          <description>RIF Go Signal Delay</description>
          <addressOffset>0xCAE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x2E7E</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>rif_tx_go_delay_qus</name>
              <description>RIF_TX_GO Delay Offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rif_rx_go_delay_qus</name>
              <description>RIF_RX_GO Delay Offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BLE_DBUS_TX_PWRCTL_WDATA</name>
          <description>Tx Power Control DBUS Write Data</description>
          <addressOffset>0xCB0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>rif_dbus_tx_pwrctl_wdata</name>
              <description>Tx Power Control DBUS Write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BLE_DBUS_TX_FSYN_WDATA</name>
          <description>Tx Fsyn DBUS Write Data</description>
          <addressOffset>0xCB2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>rif_dbus_tx_fsyn_wdata</name>
              <description>Tx Fsyn DBUS Write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BLE_DBUS_RX_PWRCTL_WDATA</name>
          <description>Rx Power Control DBUS Write Data</description>
          <addressOffset>0xCB4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>rif_dbus_rx_pwrctl_wdata</name>
              <description>Rx Power Control DBUS Write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BLE_DBUS_RX_FSYN_WDATA</name>
          <description>Rx Fsyn DBUS Write Data</description>
          <addressOffset>0xCB6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>rif_dbus_rx_fsyn_wdata</name>
              <description>Rx Fsyn DBUS Write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BLE_RX_SYNC_DELAY</name>
          <description>BLE Rx Sync Delay</description>
          <addressOffset>0xCB8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_rx_syncpulse_delay</name>
              <description>The BLE packet PDU sync pulse max delay from correlation hit pulse</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_rx_datavld_delay</name>
              <description>In Rx bursting mode, the BLE packet PDU bursting data valid max delay from last end of data valid or sync pulse</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BRF_RX_CTE_LEN_ADDR</name>
          <description>RIF Register</description>
          <addressOffset>0xCBE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1E</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>Rx_Cte_Len_Addr</name>
              <description>Radio Register Address for Rx CTE Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_ARB_BTC_START_TIME</name>
          <description>RIF ARB BTC Start Time</description>
          <addressOffset>0xCC0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xC1B2</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>btc_tx_start_time</name>
              <description>Delay when bt_grant_n is sampled and rif_tx_start will start after rifTx (Tx request from BTC to RIF-ARB for radio access) is issued from BTC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>btc_rx_start_time</name>
              <description>Delay when bt_grant_n is sampled and rif_rx_start will start when rifRx (Rx Request from BTC to RIF-ARB for radio access ) is issued by BTC</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_ARB_BLE_START_TIME_CODED</name>
          <description>RIF ARB BLE Start Time</description>
          <addressOffset>0xCC2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x5454</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_tx_start_time</name>
              <description>Delay when bt_grant_n is sampled and rif_tx_start will start after start_rif_tx (Tx Request from BLE to RIF-ARB for radio access) is issued from BLE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_rx_start_time</name>
              <description>Delay when bt_grant_n is sampled and rif_rx_start will start when start_rif_rx (Rx request from BLE to RIF-ARB for Radio access) is issued</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_ARB_BLE_START_TIME_1M</name>
          <description>RIF ARB BLE Start Time</description>
          <addressOffset>0xCC4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x5454</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_tx_start_time</name>
              <description>Delay when bt_grant_n is sampled and rif_tx_start will start after start_rif_tx (Tx Request from BLE to RIF-ARB for radio access) is issued from BLE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_rx_start_time</name>
              <description>Delay when bt_grant_n is sampled and rif_rx_start will start when start_rif_rx (Rx request from BLE to RIF-ARB for Radio access) is issued</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_ARB_BLE_START_TIME_2M</name>
          <description>RIF ARB BLE Start Time</description>
          <addressOffset>0xCC6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x5454</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_tx_start_time</name>
              <description>Delay when bt_grant_n is sampled and rif_tx_start will start after start_rif_tx (Tx Request from BLE to RIF-ARB for radio access) is issued from BLE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_rx_start_time</name>
              <description>Delay when bt_grant_n is sampled and rif_rx_start will start when start_rif_rx (Rx request from BLE to RIF-ARB for Radio access) is issued</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_ARB_CTL</name>
          <description>RIF ARB Control</description>
          <addressOffset>0xCC8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>btc_sw_abort</name>
              <description>If set, current BTC transaction will be aborted</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ble_sw_abort</name>
              <description>If set, current BLE traffic will be aborted and ble_sw_abort_intr will be issued</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ant_sw_abort</name>
              <description>If set, current ANT traffic will be aborted and ant_sw_abort_intr will be issued</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>rst_rif_arb_fsm</name>
              <description>RIF-ARB Reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Hi_pri_cutoff_dis</name>
              <description>Disable Hi priority packet cutoff</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v0</name>
                  <description>enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1</name>
                  <description>disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MH_pri_cutoff_dis</name>
              <description>Disable MH priority packet cutoff</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v0</name>
                  <description>enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1</name>
                  <description>disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ML_pri_cutoff_dis</name>
              <description>Disable ML priority packet cutoff</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v0</name>
                  <description>enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1</name>
                  <description>disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>btc_sync_frame_en</name>
              <description>Enable btc_sync_frame in arbitration decision</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v0</name>
                  <description>disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1</name>
                  <description>enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ble_sync_frame_en</name>
              <description>Enable ble_sync_frame in arbitration decision</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v0</name>
                  <description>disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1</name>
                  <description>enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
