nxp-mcuxpresso/mcux-soc-svd/KW43B43ZC6/KW43B43ZC6.xml
        <register>
          <name>SRAM0_ECC_FAULT_ATTR</name>
          <description>SRAM0 Fault Attribute Register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF8000FF</resetMask>
          <fields>
            <field>
              <name>EFPRT</name>
              <description>RAM0 ECC Fault Protection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EFMS</name>
              <description>RAM0 ECC Fault Master Size</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EFMS_0</name>
                  <description>8-bit size</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFMS_1</name>
                  <description>16-bit size</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFMS_2</name>
                  <description>32-bit size</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFMS_3</name>
                  <description>64-bit size</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EFW</name>
              <description>RAM0 ECC Fault Write</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EFW_0</name>
                  <description>Last captured ECC event was not a write bus cycle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFW_1</name>
                  <description>Last captured ECC event was a write bus cycle</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EFMST</name>
              <description>RAM0 ECC Fault Master Number</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EFMST_0</name>
                  <description>NBU Code</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFMST_1</name>
                  <description>NBU Data</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFMST_2</name>
                  <description>Radio</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFMST_3</name>
                  <description>DataStream</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFMST_4</name>
                  <description>CM33 Code</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFMST_5</name>
                  <description>CM33 Data</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFMST_6</name>
                  <description>ZEN-V Code</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFMST_7</name>
                  <description>ZEN-V Data</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFMST_8</name>
                  <description>DMA0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFMST_9</name>
                  <description>TESTPORT</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFMST_10</name>
                  <description>PKC</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EFSYN</name>
              <description>RAM0 ECC Fault Syndrome</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM0_ECC_FAULT_DATA</name>
          <description>SRAM0 ECC Fault Data Low Register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EFDL</name>
              <description>SRAM0 ECC Fault Data Low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MATRIX_MODE_CTRL</name>
          <description>Matrix Mode Control</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INFRA_AXBS0_RREN</name>
              <description>Infra AXBS0 Round Robin Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INFRA_AXBS0_RREN_0</name>
                  <description>AXBS0 in fixed priority arbitration mode at reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INFRA_AXBS0_RREN_1</name>
                  <description>AXBS0 in round robin arbitration mode at reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RADIO_AXBS0_RREN</name>
              <description>Radio AXBS0 Round Robin Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RADIO_AXBS0_RREN_0</name>
                  <description>AXBS0 in fixed priority arbitration mode at reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RADIO_AXBS0_RREN_1</name>
                  <description>AXBS0 in round robin arbitration mode at reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAIN_AXBS0_RREN</name>
              <description>Main AXBS0 Round Robin Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAIN_AXBS0_RREN_0</name>
                  <description>AXBS0 in fixed priority arbitration mode at reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAIN_AXBS0_RREN_1</name>
                  <description>AXBS0 in round robin arbitration mode at reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INFRA_AXBS0_AUTO_CG_EN</name>
              <description>Infra AXBS0 Auto Clock Gate Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAIN_AXBS0_AUTO_CG_EN</name>
              <description>Main AXBS0 Auto Clock Gate Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RADIO_AXBS0_AUTO_CG_EN</name>
              <description>Radio AXBS0 Auto Clock Gate Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC_CG_CTRL</name>
          <description>Clock Gating Ctrl of Flash Memory Control</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FMC0_AUTO_CG_DIS</name>
              <description>Flash Memory Control 0 Auto Clock Gate Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMC1_AUTO_CG_DIS</name>
              <description>Flash Memory Control 1 Auto Clock Gate Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC0_CTRL</name>
          <description>Control for Flash Memory Controller 0</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DNCBEI</name>
              <description>Disable non-correctable bus errors on flash instruction fetches</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DNCBEI_0</name>
                  <description>Bus error for non-correctable error on instruction fetch from flash</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DNCBEI_1</name>
                  <description>Disable bus error response for non-correctable error on instruction fetch from flash</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DNCBED</name>
              <description>Disable non-correctable bus errors on flash data fetches</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DNCBED_0</name>
                  <description>Bus error for non-correctable error on data fetch from flash</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DNCBED_1</name>
                  <description>Disable bus error response for non-correctable error on data fetch from flash</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DDP</name>
              <description>Disable Data Prefetch</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DDP_0</name>
                  <description>Enable Data Prefetch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DDP_1</name>
                  <description>Disable Data Prefetch</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFS</name>
              <description>Disable Flash Speculate</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DFS_0</name>
                  <description>Enable Flash Speculate</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFS_1</name>
                  <description>Disable Flash Speculate</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LKIFR1</name>
              <description>Lock IFR1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LKIFR1_0</name>
                  <description>IFR1 space can be accessed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LKIFR1_1</name>
                  <description>IFR1 space cannot be accessed. This bit is sticky. Once set, it is cleared with reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECFC</name>
              <description>Execute clear the flash cache</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECFC_0</name>
                  <description>do not clear the flash cache</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECFC_1</name>
                  <description>clear the flash cache (negate all valid bits in the cache)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFDC</name>
              <description>Disable flash data caching</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DFDC_0</name>
                  <description>enable flash data caching</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFDC_1</name>
                  <description>disable flash data caching</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFIC</name>
              <description>Disable flash instruction caching</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DFIC_0</name>
                  <description>enable flash instruction caching</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFIC_1</name>
                  <description>disable flash instruction caching</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFC</name>
              <description>Disable Flash Cache</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DFC_0</name>
                  <description>the flash cache is enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFC_1</name>
                  <description>the flash cache is diabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFLEXSTALL</name>
              <description>Flash Stall Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PFLEXSTALL_0</name>
                  <description>Flash stall is disabled when flash is busy.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFLEXSTALL_1</name>
                  <description>Flash stall is enabled when flash is busy.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RO</name>
              <description>Read-Only</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RO_0</name>
                  <description>Writes to the FMC1_CTRL are allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RO_1</name>
                  <description>Writes to the FMC1_CTRL are ignored</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU1_ACCESS_CTRL</name>
          <description>CPU1 Access Control</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C1ME</name>
              <description>CPU1 Access Main Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>C1ME_0</name>
                  <description>Enable generating responce Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C1ME_1</name>
                  <description>Disable generating responce Error, CPU1 will be stuck.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>C1HB</name>
              <description>CPU1 BUS Halt Bypass Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>C1HB_0</name>
                  <description>Disable bypass mechanism of CPU1 Sync-Bridge</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C1HB_1</name>
                  <description>Enable bypass mechanism of CPU1 Sync-Bridge</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GENERAL_REG_0</name>
          <description>General Register 0</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GENERAL_REG</name>
              <description>General Bit Field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GENERAL_REG_1</name>
          <description>General Register 1</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GENERAL_REG</name>
              <description>General Bit Field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GENERAL_REG_2</name>
          <description>General Register 2</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GENERAL_REG</name>
              <description>General Bit Field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
