nxp-mcuxpresso/mcux-soc-svd/KW43B43ZC6/KW43B43ZC6.xml
        <register>
          <name>MDAC3_INJECT_ERR</name>
          <description>MDAC3 Error Injection</description>
          <addressOffset>0xB4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RD_PROT1</name>
              <description>RD_PROT1 Error Inject</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RD_PROT1_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RD_PROT1_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WR_PROT1</name>
              <description>WR_PROT1 Error Inject</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WR_PROT1_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WR_PROT1_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RD_NONSECURE</name>
              <description>RD_NONSECURE Error Inject</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RD_NONSECURE_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RD_NONSECURE_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WR_NONSECURE</name>
              <description>WR_NONSECURE Error Inject</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WR_NONSECURE_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WR_NONSECURE_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RD_DID</name>
              <description>RD_DID Error Inject</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RD_DID_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RD_DID_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WR_DID</name>
              <description>WR_DID Error Inject</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WR_DID_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WR_DID_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MDAC4_INJECT_ERR</name>
          <description>MDAC4 Error Injection</description>
          <addressOffset>0xB8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RD_PROT1</name>
              <description>RD_PROT1 Error Inject</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RD_PROT1_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RD_PROT1_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WR_PROT1</name>
              <description>WR_PROT1 Error Inject</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WR_PROT1_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WR_PROT1_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RD_NONSECURE</name>
              <description>RD_NONSECURE Error Inject</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RD_NONSECURE_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RD_NONSECURE_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WR_NONSECURE</name>
              <description>WR_NONSECURE Error Inject</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WR_NONSECURE_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WR_NONSECURE_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RD_DID</name>
              <description>RD_DID Error Inject</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RD_DID_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RD_DID_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WR_DID</name>
              <description>WR_DID Error Inject</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WR_DID_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WR_DID_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MDAC5_INJECT_ERR</name>
          <description>MDAC5 Error Injection</description>
          <addressOffset>0xBC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RD_PROT1</name>
              <description>RD_PROT1 Error Inject</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RD_PROT1_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RD_PROT1_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WR_PROT1</name>
              <description>WR_PROT1 Error Inject</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WR_PROT1_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WR_PROT1_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RD_NONSECURE</name>
              <description>RD_NONSECURE Error Inject</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RD_NONSECURE_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RD_NONSECURE_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WR_NONSECURE</name>
              <description>WR_NONSECURE Error Inject</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WR_NONSECURE_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WR_NONSECURE_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RD_DID</name>
              <description>RD_DID Error Inject</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RD_DID_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RD_DID_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WR_DID</name>
              <description>WR_DID Error Inject</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WR_DID_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WR_DID_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MDAC6_INJECT_ERR</name>
          <description>MDAC6 Error Injection</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RD_PROT1</name>
              <description>RD_PROT1 Error Inject</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RD_PROT1_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RD_PROT1_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WR_PROT1</name>
              <description>WR_PROT1 Error Inject</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WR_PROT1_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WR_PROT1_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RD_NONSECURE</name>
              <description>RD_NONSECURE Error Inject</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RD_NONSECURE_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RD_NONSECURE_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WR_NONSECURE</name>
              <description>WR_NONSECURE Error Inject</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WR_NONSECURE_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WR_NONSECURE_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RD_DID</name>
              <description>RD_DID Error Inject</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RD_DID_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RD_DID_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WR_DID</name>
              <description>WR_DID Error Inject</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WR_DID_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WR_DID_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
